Revit 2024 API
HandRailType Class
 A rail type object that is used in the generation of hand rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class HandRailType : ContinuousRailType
Visual Basic
Public Class HandRailType _
	Inherits ContinuousRailType
Visual C++
public ref class HandRailType : public ContinuousRailType
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.ElementType
 Autodesk.Revit.DB.Architecture.ContinuousRailType
 Autodesk.Revit.DB.Architecture.HandRailType
See Also
HandRailType Members
Autodesk.Revit.DB.Architecture Namespace